package com.ittalents.goodreadsprojectv1.model.dto.quote_dtos;

import lombok.Data;

@Data
public class WriteQuoteDTO {

    //много сложно действие: трябва да можеш да свържеш със съществуваща книга, като
    //търсенето е търсене в базата (заявките от BookRepository)
    //тоест потребителят търси по кл. дума и оттам избира 1 книга (обаче е много тъпо
    // да се вадят еднакви коментари от еднакви книги само заради разл ISBN) -
    //затова тук ще трябва да е списък с книги с уникални заглавия + автор
}
